Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.SubDivisionPhaseMismatch
Sub-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub-division phase will be set to match the Toposolid.

Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.NoHostForToposolidSubregion
This sub-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option.

Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.CreateSubRegionFailed
Create sub-division failed.